//백준 11948 c++ 풀이 
//첫 4과목에서 높은 점수 3과목 , 나머지 2과목에서 높은 점수 1과목을 선택해서 총 합을 구하는 문제
//간단한 구현 문제로 정렬을 한 후에 순서대로 3개 , 1개를 더하면 되는 문제다. 
//N의 범위가 크지 않기 때문에 쉽게 풀었지만 N의 범위를 생각하면 다른 해결 방법을 찾는 것도 좋을거같았다. 
/////////////////////////////////////////////////
#include <iostream>
#include <algorithm>
using namespace std;
int s[4], m[2];
int main() {
	for (int i = 0; i < 4; i++)
		cin >> s[i];
	sort(s, s + 4);
	for (int i = 0; i < 2; i++)
		cin >> m[i];
	sort(m, m + 2);
	cout << s[1] + s[2] + s[3] + m[1] << '\n';
}